[Oreans]

&New = جديد
&Open... = فراخواني
&Save = ذخيره
Save &As... = ذخيره با نام
&Protect = حفاظت
&Help = راهنما
About... = ...درباره
Demo Version = نسخه نمايشي
Save = ذخيره

Options = تنظيمات
Application Information = اطلاعات برنامه
Protection Options = تنظيمات محافظتي
Code Replace = Code تغيير
Virtual Machine = ماشين مجازي
Customized Dialogs = پنجره هاي اختصاصي
Advanced Options = تنظيمات پيشرفته
XBundler = XBundler
Help = راهنما
Registration = ثبت
Trial Settings = تنظيمات آزمايشي
Hardware Lock = قفل سخت افزاري
Password Protection = حفاظت با كلمه عبور
Soft&ware = نرم افزار
&Customers = مشتربان
&License Manager = مدير دسترسي
&Managers = مديران
&Project = پرونده
Tools = ابزارها
H&elp = راهنما
&Contents = محتويات
&About = درباره
Export Generators = ارسال
&Software = نرم افزار
&License = مجوز دسترسي
Password = كلمه عبور
Trial Extension = اضافات آزمايشي
&Exit = خروج
P&rotect = حفاظت
Open Project = فراخواني پرونده
New Project = پرونده جديد
Save Project = ذخيره پرونده
Save Project As... = ...ذخيره پرونده بنام
Protect File = فايل محافظت شونده
Dupli&cate = تكرار
(Double click to select) = (دوبار كليك براي انتخاب)


Application = برنامه
Version = نسخه
Input Filename = نام فايل ورودي
Output Filename = نام فايل خروجي
File Size = اندازه فايل
File Information = اطلاعات فايل
Get from version info = استخراج از اطلاعات فايل
File not found = فايل پيدا نشد
Refresh = بازبيني
Same as input = مانند ورودي

Advanced Anti-Debugger = پيشرفته Anti-Debugger
Enable Protection = فعال كردن حفاظت
Advanced API-Wrapping = پيشرفته API-Wrapping
Anti Dumpers = Anti Dumpers
Entry Point Obfuscation = رمزنگاري آدرس ورود
Anti-Patching = جلوگيري از تغييرات
None = هيچ
File Patching =  تغييرات فايل
Compression = فشرده سازي
Resources = منابع
Monitor Blockers = مقابله با مانيتورها
Files Monitors = مانيتورهاي فايل
Registry Monitors = مانيتورهاي رجيستري
Delphi/BCB Form Protection = حفاظت Delphi/BCB Form
Resources Encryption = رمزنگاري منابع
VMWare/Virtual PC = VMWare/Virtual PC
Compatible = سازگار
When Debugger Found = Debugger زمان يافتن 
Enable Encryption = فعال كردن رمزنگاري
Display Message = نمايش پيام
Exit Silently = خروج نامشخص
Crash Application = خرابي برنامه
Metamorph Security = Metamorph امنيت
Ring-0 Protection = Ring-0 محافظت
(not available in DEMO) = (در نسخه نمايشي در دسترس نيست)

Import = بازيابي
Export = ذخيره
Reset Messages = بازيابي پيامها

Global Caption = عنوان عمومي
Debugger found = Debugger پيدا شد
Monitor software found = نرم افزارهاي مانيتورينگ يافت شد
Cracking tool found = ابزارهاي نفوذ يافت شد
File corrupted = فايل خراب شده است
(Not displayed in this version) = (در اين نسخه نمايش داده نمي شود)
Internal exception occured =  رخداد داخلي به وجود آمده است
Virtual Machine Detected = ماشين مجازي شناسايي شده است


Enable CodeReplace Technology = فعال كردن تكنيك جايگزيني كد
Functions to remove using the CodeReplace Technology: = :توابعي كه توسط تكنيك جايگزيني كد حذف مي شوند
Assembly code inside function: = :كد اسمبلي داخل تابع 
Force simulation before protection = تاكيد بر انجام شبيه سازي قبل از محافظت
Run with parameters = اجرا توسط پارامتر
Start Simulation = شروع شبيه سازي

Virtual API-Wrapper = مجازي API-Wrapper
Imported DLLs: = : وارد شده DLLs
Functions to Virtualize: = : توابع براي مجازي سازي
API Virtualization Level: = :درجه مجازي سازي توابع
Processor Specifications = مشخصات پردازنده
Processor Type: = :نوع پردازنده
Multiprocessor: = :تعداد پردازنده ها
Opcode Type: = :نوع Opcode
Dynamic Opcode: = :پويا Opcode
VM Complexity: = :پيچيدگي ماشين مجازي
VM size (aprox): = : اندازه تقريبي ماشين مجازي
Execution Speed: = :سرعت اجرا
Entry Point Virtualization = مجازي سازي نقطه شروع برنامه
Multi Branch Technology = تكنيك چند شاخه اي 

Mutable CISC processor = متغير CISC پردازنده
Mutable RISC-64 processor = متغير RISC-64 پردازنده
Mutable RISC-128 processor = متغير RISC-128 پردازنده
Mutable CISC-2 processor = متغير CISC-2 پردازنده

Static opcodes = كدهاي ثابت
Metamorphic - Level 1 = كد جهشي - درجه 1
Metamorphic - Level 2 = كد جهشي - درجه 2
Metamorphic - Level 3 = كد جهشي - درجه 3

Disabled = غير فعال
20% Dynamic = ٢٠% كد پويا 
40% Dynamic = ٤٠% كد پويا
60% Dynamic = ٦٠% كد پويا
80% Dynamic = ٨٠% كد پويا


Enable XBundler = XBundler فعال سازي
Make files visible to OpenDialog = OpenDialog مرئي سازي فايلها براي
Allow bundling from any directory = اجازه چسباندن فايل از هر زير فهرست
AVI files support = AVI پشتيباني فايلهاي 
Deleted extracted on exit = حذف فايلهاي بازشده در هنگام خروج
Files to bundle: (drag files here) = فايل ها براي چسبانده ( فايلها را به اينجا بكشيد )
XBundler Options = XBundler تنظيمات
Add File = افزودن فايل
Delete File = حذف فايل

Filename = نام فايل
Write to disk? = نوشتن بر روي ديسك؟
Extraction Path (if written to disk) = مسير اجرا ( درصورت نوشتن بر ديسك )


Encrypt Application = رمزنگاري برنامه
Protect as DLL Plugin = DLL Plugin محافظت از
Protect DLL plugin = DLL Plugin محافظت از
Last Section Name = نام آخرين بخش
.NET assemblies = .NET assemblies
Active Context = Active Context
Enable support = فعال كردن پشتيباني
Splash screen settings = تنظيمات صفحه اسپلاش
Mouse Click to proceed = كيك ماوس براي انجام
Display during a number of seconds = نمايش در زمان ثانيه

This option will encrypt your protected application. You should never uncheck this option, only for debug purposes. = اين گزينه برنامه شما را با رمزنگاري محافظت مي كند ، شما نبايد آن را غير فعال كنيد مگر اينكه بخواهيد براي ديباگ آزمايش كنيد

Check this option only if your protected DLL will be used as plugin in third party software. = .در ساير برنامه ها استفاده مي شود plugin شما به صورت يك DLL از اين گزينه استفاده نكنيد مگر زماني كه 

You can change the name of the last section added by Themida = مي توانيد نام آخرين بخشي را كه توسط Themida به برنامه اضافه مي شود تعيين نماييد

This option should always be enabled to protect your .NET assemblies = براي محافظت از فايلهاي .Net اين گزينه هميشه بايد فعال باشد

Support for Active Context based DLLs = پشتيباني از DLL هايي كه به صورت Active Context هستند

Select a BMP-8 image that will be displayed when your application is launched = فايل تصويري مورد نياز براي نمايش در ابتداي اجراي برنامه را انتخاب كنيد

The user must click in the Splash Screen to continue running the protected application = كاربر بايد بر روي صفحه نمايشي كليك كند تا اجراي برنامه ادامه پيدا كند

The splash screen will be displayed for a custom number of seconds before continue running the protected application = قبل از ادامه برنامه ، صفحه نمايشي به زمان تعيين شده روي صفحه ظاهر مي شود

This option will enable Trial and Licensing protections in Ring-0, which will enhance the way that trial information is stored in the system. If you check this option, a device driver will be embedded and extracted automatically when your application runs. Notice that the Hardware ID is different if you enable or disable this option. = اين گزينه استفاده از لايه كرنل را براي ايجاد نسخه نمايشي يا مجوز دار فعال مي كند. با انتخاب آن يك درايور به فايل الحاق مي شود كه همراه با اجرا در سيستم نصب شده و عملكرد برنامه را بهبود مي بخشد. توجه كنيد كه كد سخت افزاري بدون اين گزينه با كد سخت افزاري با اين گزينه متفاوت است


Reading SDK Macros = SDK خواندن ماكروهاي
Redirecting and Encrypting SDK Macros = SDK تغيير مسير و رمزنگاري ماكروهاي
Merging sections / Preparing PE Header = PE Header ادغام بخش هاي فايل/ آماده سازي 
Examining and Wrapping API Calls = API آزمايش و كد كردن فراخواني هاي 
Generating Unique SecureEngine Code = انحصاري SecureEngine Code توليد
Linking SecureEngine Code with Application = با برنامه SecureEngine اتصال كد
Generating Unique Virtual Machine = توليد ماشين مجازي انحصاري
Compressing Virtual Machine = فشرده سازي ماشين مجازي
Virtualizing VM / CodeReplace Macros = Virtualizing VM / CodeReplace Macros
Compressing Application and Resources = فشرده سازي برنامه و منابع آن
Encrypting Application and Resources = رمزنگاري برنامه و منابع آن

Test Protected File = آزمايش فايل محافظت شده
Protect = محافظت
Cancel = لغو
Play sound when protection finishes = پخش صدا در هنگام پايان محافظت

This option supervises at any time if your application is running under any kind of debugger. = اين گزينه باعث عدم اجراي برنامه شما در هنگام وجود هر نوع ديباگر مي شود
This option avoids your application from being dumped from memory to disk even using the most advanced memory dumping tools = اين گزينه باعث جلوگيري از ذخيره برنامه از حافظه بر ديسك جتي با استفاده از پيشرفته ترين ابزاري ها دسترسي به حافظه مي شود 
This option removes and encrypts the entry point of your application, executing it from a secure place in memory = اين گزينه براي محافظت از نقطه شروع برنامه شما در حافظه و اجراي آن در يك محيط امن مي شود
This option will keep your application resources fully encrypted against modifications = اين گزينه با رمزنگاري كامل منابع مورد استفاده در برنامه جلوي تغيير آنها را ميگيرد
If you want that your application will run inside VMWare/VirtualPC you must check this option = اگر مي خواهيد برنامه شما در ماشين مجازي VMWare/VirtualPC اجرا شود اين گزينه را فعال كنيد
This option will wrap the APIs used in your application to avoid a possible reconstruction of your original application = اين گزينه باعث اختفاي كامل توابع سيستم بكار رفته در برنامه شما شده و جلوي ساخت مجدد برنامه را مي گيرد
This option detects if any modification is done to your protected application, either by a cracker or a virus = اين گزينه تغييرات اعمال شده بر روي برنامه شما را توسط ويروس يا قفل شكن كشف مي كند
This option will activate the internal Metamorph engine to generate multiples opcode mutations for a single block of code = هاي تغيير يافته براي قسمت هاي برنامه شما راه اندازي مي كند opcode برنامه را براي توليد  Metamorph اين گزينه قسمت موتور
This option will protect your application against memory patching = اين گزينه جلوي تغيير برنامه شما در حافظه را مي گيرد 
This option allows you to choose the desired option to perform when a debugger or cracking tool has been found in memory =  اين گزينه امكان تصميم گيري در مورد عمليات پس از كشف ديباگر در حافظه مي دهد
This option keeps your application code compressed meanwhile it is not executed = اين گزينه باعث مي شود كه برنامه شما در زماني كه اجرا نشده است به صورت فشرده باقي بماند
This option keeps the resources in your application fully compressed = اين گزينه باعث فشرده شدن منابع بكار رفته در برنامه شما مي شود
This option will compress the SecureEngine code that is appended into your protected application = ملحق شده به برنامه محافظت شده شما مي شود SecureEngine اين گزينه باعث فشرده شدن كد
This option will detect/fool possible files monitors when your protected application is running = اين گزينه باعث شناسايي/اختلال نرم افزارهاي مانيتور كردن فايل در زمان اجراي برنامه محافظت شده شما مي شود
This option will detect/fool possible registry monitors when your protected application is running = اين گزينه باعث شناسايي/اختلال نرم افزارهاي مانيتور كردن رجيستري در زمان اجراي برنامه محافظت شده شما مي شود
This option will protect your Delphi/BCB forms against reconstruction from memory. Note that this option is incompatible with some Delphi/BCB applications = با اين گزينه ناسازگار هستند Delphi/BCB بكار مي رود. توجه كنيد كه بعضي از برنامه هاي ساخته شده با  Delphi/BCB اين گزينه براي محافظت از فرم هاي بكار رقته در برنامه هاي ساخته شده در 
Load your customized messages from a file = پيام هاي شخصي شده خود را از فايل بارگذاري كنيد
Save your customized messages to a file = پيامهاي شخصي شده خود را در فايل ذخيره كنيد
This list displays all the DLLs imported by your application = هاي بارگذاري شده توسط برنامه شما است DLL ليست شامل كليه 
This list displays all the imported functions for the selected DLL. You can select which functions will be "virtualized" = انتخاب شده است . شما مي توانيد توابعي را براي مجازي سازي انتخاب كنيد DLL ليست شامل كليه توابع استفاده شده در 
You can import API names from a text file. The imported APIs will be virtualized in the current project = مورد نظر براي مجازي سازي را از فايل متني بارگذاري نماييد API شما مي توانيد نام
Select the maximun number of instructions to virtualize from your application entry point = بيشترين تعداد دستور مجازي شده در نقطه شروع برنامه خود را مشخص كنيد
This option will insert multiple conditional branch instructions inside your unique Virtual Machine, making it harder to analyze = اين دستور با قرار دادن چند شاخه از دستورات در قسمت موتور مجازي انحصاري برنامه محافظت شده باعث سخت شدن تحليل كد براي نفوذگران مي شود
You can save the current selected APIs into a text file to be imported by another project = انتخاب شده را در يك فايل متني ذخيره كرده و بعدها در پروژه ديگر از آن استفاده كنيد API مي توانيد
Complexity level to emulate each wrapped API = API درجه پيچيدگي براي شبيه سازي هر قسمت از 

Changes have been made. Do you want to save project? = تغييراتي اعمال شده اند آيا مي خواهيد پرونده را ذخيره كنيد؟
Save Changes = ذخيره تغييرات

*UNSAVED* = *ذخيره نشده*
Invalid Project File. Please, recreate a new one = پرونده نامعتبر است . لطفا پرونده جديدي بسازيد
Load Project = بارگذاري پرونده
You need XBundler .NET for your .NET application. Please contact info@oreans.com = تماس بگيريد info@oreans.com احتياج داريد با  .NET براي محافظت از برنامه هاي  XBundler .NET در صورتي كه به 
Sorry, Themida Standard cannot protect .NET files. You need to upgrade to Themida Professional for .NET support. Upgrade now? = ارتقا دهيد. آيا مي خواهيد اكنون ارتقا انجام شود ؟ .NET براي محافظت Themida Professional را ندارد و شما بايد به نسخه .NET امكان پشتيباني از فايلهاي  Themida Standard متاسفانه
Save Project = ذخيره پرونده
Save Project As... = ...ذخيره پرونده به نام
No file selected. Please select a file to protect (Input Filename) =  فايلي انتخاب نشده است . لطفا يك فايل را براي محافظت انتخاب كنيد - نام فايل ورودي
No Output file selected. Please select an Output file before protecting = فايل خروجي انتخاب نشده است . لطفا قبل از محافظت يك فايل خروجي تعيين كنيد
File does not exists: = :فايل وجود ندارد
File is already protected/compressed: = :فايل در حال حاضر محافظت/فشرده شده است
File has invalid macros insertion: = :ماكروهاي نامعتبر در فايل وجود دارد
Please, review your macros again = لطفا دوباره ماكروهاي خود را بازبيني كنيد 
File cannot be accessed for protection: = :امكان دسترسي به فايل براي محافظت وجود ندارد
Please select a new file to protect (Input Filename) = لطفا فايل جديدي را براي محافظت انتخاب كنيد( فايل ورودي )
File has not being simulated. Please simulate the file before protection or uncheck the "Force simulation before protecting" checkbox = فايل شبيه سازي نشده است. لطفا ابتدا شبيه سازي را انجام داده يا گزينه شبيه سازي قبل از محافظت را غير فعال نماييد
Open Input File = گشودن فايل ورودي
The resources section in your application is empty. Themida needs to rebuild your application header. Proceed? = بخش منابع در فايل شما خالي است. دميدا ساختار فايل شما را تغيير خواهيد داد آيا موافق هستيد ؟
Rebuild Header = Header بازسازي
File is compressed or already protected: = :فايل فشرده شده يا قبلا محافظت شده است
Your application seems to be in use or running in memory. Please, make sure to close it before proceeding = به نظر ميرسد كه برنامه شما در حال اجرا مي باشد. قبل از ادامه كليه برنامه هاي باز را ببنديد
Error = خطا
Your application header is incompatible with Themida. Do you want Themida to rebuild your application header? = ساختار برنامه شما با دميدا ناسازگار است . آيا مي خواهيد دميدا ساختار برنامه شما را تغيير دهيد ؟
.NET limitation = .NET محدوديت
Sorry, you cannot change the global message caption in demo version = متاسفانه شما امكان تغيير پيام عنوان اصلي را در نسخه نمايشي نداريد
Warning! The current CodeReplace macros are not valid for the selected file. CodeReplace macros removed = متاسفانه ماكروهاي فعلي جايگزيني كد براي فايل جاري معتبر نيست . آيا مي خواهيد ماكروهاي جايگزيني كد حذف شوند؟
Warning = اخطار
Warning! The current application is already protected/compressed. Do you still want to protect it? = برنامه شما در حال حاضر محافظت شده و يا فشرده شده است ، آيا همچنان مايل به محافظت از آن هستيد ؟
File has a missing macro START or END: = :در فايل ناقص است START يا END يكي از ماكروهاي
Please review your macros again = لطفا ماكروهاي خود را بازبيني كنيد
File cannot be opened: = :فايل باز نمي شود
Make sure that other application is not using it = !اطمينان يابيد كه برنامه ديگري از آن استفاده نمي كند
File to protect has an invalid PE header. Unable to inspect file = فايل معرفي شده براي محافظت داراي ساختار نامعتبر است. امكان ادامه وجود ندارد
File to protect contains one macro with few lines of code on it. Please review your macros again = فايل ورودي شامل ماكرويي با كدهاي كوتاه در داخل آن مي باشد. لطفا ماكروهاي استفاده شده را  بازبيني كنيد
Sorry, the current version of Themida does not support CodeReplace in Visual Basic Pcode applications = متاسفانه نسخه فعلي دميدا از امكان جايگزيني كد در برنامه هايي كه در محيط مجازي ويژوال بيسيك اجرا مي شوند پشتيباني نمي كند
Sorry, the current version of Themida does not support CodeReplace in .NET applications = متاسفانه اين نسخه از دميدا از تكنولوژي جايگزيني كد براي برنامه هاي تحت نت پشتيباني نمي كند
Unable to find a function to add CodeReplace technology = امكان پيدا كردن تابعي براي افزودن فن آوري جايگزيني كد وجود ندارد
Run with parameters = اجرا با پارامتر
Please enter the parameters = لطفا پارامترها را وارد كنيد
Sorry, you cant disable that option in demo version = متاسفانه در نسخه نمايشي نمي توانيد اين گزينه را غير فعال كنيد
Messages exported to = ارسال پيام ها به :
Messages imported from = دريافت پيام ها از :
Themida GUI Overview = Themida بازبيني رابط گرافيكي
Protect Now = محافظت فوري
SecureEngine Technology = SecureEngine فن آوري
SecureEngine Macros = SecureEngine ماكروهاي
Code Replace = جايگزيني كد
Software Updates = بروزرساني هاي نرم افزار
What is XBundler = چيست؟ XBundler
Using XBundler = XBundler نحوه استفاده از

Scenarios for Using XBundler = XBundler حوارات لإستخدام
*** ERROR: Project file does not exist or invalid. (Exit code 1) *** = ***(١ خطأ: ملف المشروع غير موجود أو تالف.(كود الخروج***
*** ERROR: File to protect does not exist. (Exit code 2) *** = ***(٢ خطأ: الملف المراد حمايته غير موجود.(كود الخروج***
*** ERROR: File is already protected. (Exit code 3) *** = ***(٣ خطأ: الملف محمي بالفعل.(كود الخروج***
*** ERROR: Error in SecureEngine macros. Please review them again. (Exit code 4) *** = *** (من فضلك قم بمراجعتهم مرة أخرى(كود الخروج ٤ .SecureEngine macros خطأ: خطأ فى***
*** ERROR: File to protect cannot be opened. (Exit code 2) *** = ***(٢ خطأ: لا يمكن فتح الملف المراد حمايته.(كود الخروج***
*** ERROR: The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = *** فقط يتم عرضها بشكل صحيح BMP 256 خطأ:ملف الصورة لا يحتوى على 256 لون.ملفات***
*** ERROR: The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = ***الغير مضغوطة فقط يتم عرضها بشكل صحيح BMP مضغوط.ملفات BMP خطأ:ملف الصورة***
Macros found: = :التى تم العثور عليها Macros
*** Fatal error while protecting file. (Exit Code 5) *** = ***(خطأ أثناء حماية الملف(كود الخروج ٥***
*** ERROR: Cannot write protected file. Make sure the file is not in use. (Exit code 6) *** = ***(٦ خطأ: لا يمكن كتابة الملف المحمى.تأكد أت الملف غبر مستخدم.(كود الخروج***
Generating Unique SecureEngine Code... = ...اختصاصي SecureEngine توليد كد
Linking SecureEngine Code with Application... = ...بالبرنامج SecureEngine ربط كود
done. = .تم
Encrypting Application and Resources... = ...رمزنگاري برنامه و منابع آن
Compressing Application and Resources... = ...فشرده سازي برنامه و منابع آن
Macros processed: = :هاي انجام شده Macros

processed: = :انجام شده
Application successfully protected. = .تمت حماية البرنامج بنجاح
Do you want to go to the order form Themida subscription plans? = ؟Themida هل تريد الذهاب إلى إطار خطط إشتراك
No file selected. Please, select a file to protect (Input Filename) = (لم يتم إختيار ملف بعد.من فضلك إختر ملف لحمايته(أدخل إسم ملف
Question = سؤال
-- Files to Bundle -- = --الملفات المراد وضعها فى الحزمة--
The path of the file that you are inserting must be relative to: = :مسار الملف يجب أن يكون نسبى بالنسبة إلى
All imported by ordinal! = .تم إستيراد الكل عن طريق الأصلى
Medium = متوسط
Normal = عادى
High = زياد
Supreme = خيلي زياد
Extreme = شديد
Highest = بيشترين

This option is not enabled in DEMO version = هذا الإختيار غير متاح في النسخة الغير كاملة
DEMO Restriction = محدوديت هاي نسخه نمايشي
The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = فقط يتم عرضها بشكل صحيح BMP 256 ملف الصورة لا يحتوى على 256 لون.ملفات
The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = الغير مضغوطة فقط يتم عرضها بشكل صحيح BMP مضغوط.ملفات BMP ملف الصورة
Sorry, Themida DEMO does not support RISC-128 processors = RISC-128 لا يدعم معالجات Themida DEMO ، عفوآ
Processor Type = نوع پردازنده
Sorry, Themida DEMO does not support Dynamic Opcodes = الديناميكية Opcodes لا يدعم معالجات Themida DEMO ، عفوآ
The file is never extracted to disk! = !لم يتم إستخلاص الملف إلى القرص مطلقآ
Select file/s to bundle = إختر الملف / الملفات المراد وضعها فى الحزمة
No file selected. Please, select a file to protect (Input Filename) = (لم يتم إختيار ملف بعد.من فضلك إختر ملف لحمايته(أدخل إسم ملف
Last Modified: = :آخرين تغييرات
(Application header has been rebuilt by Themida) = (Themida البرنامج تم إعادة بناءه عن طريق header)
File Type: Windows Standard Executable = Windows Standard Executable :نوع الملف
File Type: Visual Basic Native Executable = Visual Basic Native Executable :نوع الملف
File Type: Visual Basic PCode Executable = Visual Basic PCode Executable :نوع الملف
File Type: Windows .NET Executable = Windows .NET Executable :نوع الملف
File Type: MACROMEDIA Executable = MACROMEDIA Executable :نوع الملف
File Type: PowerBuilder Application = PowerBuilder Application :نوع الملف
File Type: Excelsior JET Application = Excelsior JET Application :نوع الملف
File Type: Dynamic Link Library (DLL) = Dynamic Link Library (DLL) :نوع الملف
File Type: OLE Control Extension (OCX) File = OLE Control Extension (OCX) :نوع الملف
File Type: Screensaver File = Screensaver File :نوع الملف
File Type: Windows NT Service = Windows NT Service :نوع الملف
File Type: Borland Library = Borland Library :نوع الملف
File Type: Linux Executable (ELF/i386) = Linux Executable (ELF/i386) :نوع الملف
File Type: NT Device Driver = NT Device Driver :نوع الملف

*** Protected with Code Virtualizer *** = ***تمت الحماية بطريقة إفتراضية الكود***
Virtual Machine Macro Functions: = :الألة الوهمية Macro دوال
CodeReplace Macro Functions: = :CodeReplace Macro دوال
CodeEncrypt Macro Functions: = :CodeEncrypt Macro دوال
ClearCode Macro Functions: = :ClearCode Macro دوال
Registered Macro Functions: = :المسجلة Macro دوال
Unregistered Macro Functions: = :الغير المسجلة Macro دوال
Read functions automatically = قراءة الدوال أوتوماتيكيآ
Read functions from SDK = SDK قراءة الدوال من
File already protected/compressed. = .الملف محمىٍ/مضغوط بالفعل
Error: There is a missing START or END in one of your macros. = مفقودة فى الملف START أو END macro:خطأ
Error: Unable to open the selected file. File may be in use. = .خطأ:لا يمكن فتح الملف المختار.ربما يكون مستخدم
Error: Invalid PE header in selected file. = .فى الملف المختار خاطئ PE header :خطأ
Error: The included code inside a macro is too small. = .صغير جدآ macro خطأ: الكود المحتوى داخل
Error: There are at least a nested VM macros. VM macros cannot be nested. = .لا يمكن أن تتداخل VM macros .متداخلة VM macros خطأ: على الأقل توجد 
Error: The selected file is not an x64 application. You need Themida x32 to protect that application. = .لحماية هذا البرنامج Themida x32 أنت محتاج .x64 خطأ: البرنامج المختار ليس برنامج
Error: The selected file is an x64 application. You need Themida x64 Edition to protect that application. = .لحماية هذا البرنامج Themida x64 أنت محتاج .x64 خطأ: البرنامج المختار برنامج 
Project: = :پرونده
Select functions from MAP file = MAP إختر دوال من ملف
Read functions automatically = قراءة الدوال أوتوماتيكيآ
How many functions do you want to add? = كم عدد الدوال المراد إضافتها؟
OK = آري
Sorry, the required MAP file was not found. Please, generate a MAP file for your application = جديد للبرنامج MAP غير موجود. من فضلك قم بتوليد ملف MAP عفوآ ،ملف
There are not functions to simulate. Please, insert some functions either manually or automatically = لا يوجد دوال للمحاكاه.من فضلك قم بإضافة بعض الدوال يدويآ أو أوتوماتيكيآ
Simulator = شبيه ساز
Information = اطلاعات
None = هيچ
Message = پيام
Customize Dialog = پيامهاي اختصاصي
Close = بستن

Internal Protection Messages = رسائل الحماية الداخلية
Trial/Registration Messages = Trial/Registration رسائل
Will be displayed by WinLicense = WinLicense سوف يتم عرضها عن طريق
Displayed by SDK or not displayed = أو لم يتم عرضها SDK تم عرضها عن طريق
Cannot update oreans.sys driver (admin rights) = (الحقوق الإدارية) oreans.sys driver لا يمكن تحديث
Cannot open oreans.vxd driver (already in use) = (مستخدم بالفعل) oreans.vxd driver لا يمكن فتح
Driver cannot be updated = Driver لا يمكن تحديث
Computer needs to be reset to install driver = driver يجب إعادة تشغيل الجهاز لتثبيت
Cannot write oreans.vxd (already in use) = (مستخدم بالفعل) oreans.vxd driver لا يمكن كتابة

Trial nag screen (reminder) = (الشاشة المزعجة للنسخة التجريبية(المذكرة
Trial days expired = عدد الأيام للنسخة التجريبية إنتهت
Trial executions expired = عدد مرات العمل للنسخة التجريبية إنتهت
Trial date expired = التاريخ للنسخة التجريبية إنتهى
Trial runtime expired = العمل للنسخة التجريبية إنتهى
Trial global time expired = الوقت العام للنسخة التجريبية إنتهى
Trial locked to different country = النسخة التجريبية مغلقة لبلدان مختلفة
Trial extension key corrupted = مفتاح الإمتداد للنسخة التجريبية تالف
No more trial extensions allowed = الإمتدادات للنسخة التجريبية لم تعد متاحة
Show registration info (only first time when registered) = (إظهر معلومات التسجيل (أول مرة فقط عند التسجيل
License days expired = روزهاي مجوز سپري شده است
License executions expired = دفعات اجراي مجوز انجام شده است
License date expired = تاريخ مجوز منقضي شده است
License global time expired = زمان عمومي مجوز سپري شده است
License key corrupted = مجوز خراب شده است
License locked to different machine = مجوز مربوط به سيستم ديگري است
License without machine locking = مجوز بدون ارتباط با سخت افزار
No more hardware changes allowed = تغييرات بيشتري در سخت افزار مجاز نيست
Stolen license key = مجوز سرقت شده
License is not expirable = مجوز تاريخ مصرف ندارد
License required to run = بدون مجوز اجرا نمي شود
Trial/Licensing Manager manipulated = Trial/Licensing Manager تمت معالجة
Invalid user/password (for password dialog) = (إسم المستخدم/كلمة السر غير صحيحة (لمحادثة كلمة السر

This application(s) will run in trial/restricted mode, until registered. = هذا البرنامج سيعمل فى إطار مقيد/تجريبي، حتى التسجيل
Days Expiration = تعداد روزهاي پايان
Date Expiration = تاريخ پايان
Executions = تعداد اجرا
Run Time (execution) = (توقيت العمل(التنفيذ
Global Time = التوقيت العام
days = روزها
times = دفعات
minutes = دقيقه ها
Unlimited = نامحدود
(For custom restrictions) = (من أجل قيود معينة)
Trial Restrictions = قيود التجريب
Clock Change = تغيير ساعت
Trial Extension = إمتداد للنسخة التجريبية
Lock trial to user language = إغلاق النسخة التجريبية على أساس لغة المستخدم
Allow trial period to be extended (with a valid key) = (السماح بإمداد مدة التجريب(بتصريح صحيح
Extension Key distribution options = خصائص توزيع تصاريح الإمتداد
With single file = بملف واحد
With Registry = بالتسجيل
Value Name = إسم القيمة
Maximum Extensions = الحد الأقصى للإمتدادات
Maximum extensions allowed = الحد الأقصى للإمتدادات المسموح بها

This option sets a trial period to a certain amount of days since the application is started for the first time = هذا الإختيار يحدد عدد أيام التجريب من تاريخ أول تشغيل للبرنامج
This option sets an exact date for the end of the trial period = هذا الإختيار يحدد تاريخ إنتهاء فترة التجريب
This option sets an exact number of executions allowed for an application = هذا الإختيار يحدد عدد مرات العمل المسموح بها لهذا البرنامج
This option sets an exact amount of time (in minutes) that an application can stay in memory = هذا الإختيار يحدد الوقت المسموح به(بالدقائق)لتواجد البرنامج فى الذاكرة
This option sets an exact amount of total time (in minutes) that an application can run during all Windows® sessions = Windows® هذا الإختيار يحدد عدد الدقائق الكلية المسموح للبرنامج العمل خلالها أثناء عمل 
This option allows an application to run in trial mode without any restrictions added by WinLicense = WinLicense هذا الإختيار يسمح للبرنامج بالعمل تجريبيآ بدون قيود مضافة من
You can select how sensitive WinLicense will behave against clock changes. If for example, you select "1 day clock back", WinLicense will ignore if the clock has been turned back for 1 day. = سوف يتجاهل تأخير الساعة ليوم واحد WinLicense ،"ضد تغيير الساعة. مثلآ إذا إخترت "تأخير الساعة يوم واحد WinLicense يمكنك تحديد درجة حساسية
This option allows an application to be locked to specific country when it runs in trial mode = هذا الإختيار يسمح بغلق البرنامج لدولة معينة أثناء العمل كبرنامج تجريبى
This option allows you to extend the trial period of your application with special trial extension keys = هذا الإختيار يسمح بإمداد فترة التجريب للبرنامج بإستخدام تصاريح خاصة
This option sets the name of a trial extension file to be searched by WinLicense when the application is being started = ببحثها عند بداية عمل البرنامج WinLicense هذا الإختيار يحدد عدد تصاريح الإمداد ليقوم
This option is used to allow distribution of extension keys as Windows® Registry key files = Windows® Registry هذا الإختيار يسمح بتوزيع تصاريح الإمداد علي هيئة ملفات
This option limits the amount of trial extensions that an application can be extended = هذا الإختيار يحدد عدد مرات الإمداد المسموح بها للبرنامج

Any clock change = أى تغيير للساعة
1 hour clock back = تأخير الساعة ساعة واحدة
1 day clock back = تأخير الساعة يوم واحد

This application(s) can be registered, with the presence of a valid key. = .هذا البرنامج يمكن أن يكون مسجلآ عن طريق تصريخ صحيح
License Keys Accepted = تم قبول التصاريح
Types of accepted License Keys = أنواع التصاريح المقبولة
Single file = ملف واحد
Registry = التسجيل
Security Options = خيارات الأمان
Enable SmartActivate® System for user-side generated keys. = للتصاربح المولدة من قبل المستخدم SmartActivate® السماح بنظام
Allow only hardware dependent (locked) registrations. = .hardware السماح فقط بالتسجيلات المعتمدة على
Accept only temporary keys (that expire). = .(قبول التصاريح المؤقتة فقط(المنتهية
Application only runs when registered. (Requires a key to run) = .البرنامج لا يعمل الإ بعد التسجيل
Clear trial info when registered. = .مسح المعلومات التجريبية فى حالة التسجيل
License Key Signature = بصمة التصريح
Level 1 = المستوى ١
Level 2 = المستوى ٢
For professional and elegant licensing control, WinLicense offers the SmartActivate® System. This technology allows an application to be registered using SmartActivate® keys = SmartActivate® هذه التقنية تسمح بتسجيل البرنامج بإستخدام تصاريح. SmartActivate® يقدم نظام WinLicense ،من أجل تحكم محترف
This option restricts the use of registration keys to a specific computer. As each computer has an unique machine ID (processor type, hard disk and BIOS serial), WinLicense can lock a registration key to that specific machine = مفتاح تسجيل إلى تلك الماكنة المعيّنة WinLicense يحدّد هذا الخيار إستعمال التسجيل إلى حاسوب معيّن. بينما كلّ حاسوب له هوية ماكنة فريدة (نوع معالج، مسلسل السير الذاتية والقرص الصلب)، يمكن أن يقفل
This option denies the use of "time unlimited" registration keys and forces WinLicense to accept only temporary registration keys = لقبول مفاتيح التسجيل المؤقتة فقط WinLicense ينكر هذا الخيار إستعمال "وقت" تسجيل غير محدود و يقفل ويجبر
This option allows user to run an application only in the presence of a valid registration key. WinLicense will terminate the application if no key is found or if it is invalid = سينهي التطبيق إذا لا يوجد مفتاح  أو إذا هو تالف WinLicense .هذا الخيار يسمح للمستخدم بالعمل فقط في وجود مفتاح تسجيل صحيح
The purpose of this option is to clear the trial information from a computer once an user receives a valid registration key and registers an application. If the user decides to remove the registration key or it expires, the trial period will restart from zero = إنّ غرض هذا الخيار أن تتبدّد معلومات التجربة عند إستعمال مفتاح تسجيل صحيح إذا قرّر المستعمل أن يزيل التسجيل أو إنتهي، فترة التجربة ستستأنف من صفر
This option allows you to select the signature level used by WinLicense to check that licenses for your applications are genuine = لتدقيق تلك الرخص لتطبيقاتك أصيلة WinLicense هذا الخيار يسمح لك لإختيار مستوى التوقيع مستعمل من قبل

Enable Password Protection = مكّن حماية كلمة سر
Password requirement = طلب كلمة سر
Password Action = عمل كلمة السر
Encrypt EXE using the password hash. = 
On Normal / Trial Version = على الوضع الطبيعي / نسخة تجربة
On Registered Version = على النسخة المسجّلة
Never ask for a password. = أبدا لا تطلب كلمة سر
I will ask for a password manually. = .أنا سأسأل عن كلمة سر يدويا
Automatically, ask for a password only the first time. = أوتوماتيكيا، أطلب كلمة سر فقط فى المرة الأولى
Automatically, always ask for a password. = أوتوماتيكيا، أطلب دائما كلمة سر

Hardware Lock = قفل الأجهزة
Custom Hardware Items = مواد الأجهزة مختارة
Hardware Items = مواد الأجهزة
All hardware items = كلّ مواد الأجهزة
CPU = CPU
BIOS =  BIOS
MAC Address = MAC Address
HDD Serial = HDD Serial
Allowed CPU changes = CPU إسمح بتغييرات
Allowed BIOS changes = BIOS إسمح بتغييرات
Allowed NIC changes = NIC إسمح بتغييرات
Splash settings = خصائص البقعة

Keep Trial Running = ادامه اجراي دوره آزمايشي
Keep running = ادامه اجرا
Launch Application when Trial Expired = اجراي برنامه زمان پايان دوره آزمايشي
Launch Application = اجراي برنامه 
Application Name: = :نام برنامه
Enable Custom Event = فعال كردن رخدادهاي اختصاصي
Export Specific Generators = تصدير مولدات معينة
Event Name: = :إسم الحدث
Export Generators = تصدير المولدات
Custom Event = حدث معين
This option will export a specific license generator when your application is being protected = هذا الخيار سيصدّر مولّد رخصة معيّن متى تمت حماية البرنامج
This option will run an external application when the trial period in your application has expired. = هذا الخيار سيشغل برنامج خارجي عندما تنتهى فترة التجربة للبرتامج
You can define a custom event to exclude the initialization of several protected applications at the same time. This option is also suitable when your application is launched many times per minute. = يمكن أن تعرّف حدث معين لإستثناء تهيئة عدّة برلمج محمية في نفس الوقت .هذا الخيار مناسب أيضا متى كان البرنامج يطلق العديد من الأوقات بالدّقيقة
Check this option if you want that your application continues running in trial mode if an invalid license key is present. =  إختر هذا الخيار إذا أردت أنّ يستمر البرنامج بالعمل في نمط التجربة إذا كان الترخيص تالف
*** Demo Version *** = ***نسخة غير كاملة***
Destroy Exports section = تدمير قطاع التصديرات
This option will destroy the export table of your DLL control for maximum security = وذلك لزيادة الأمان DLL هذا الخيار سيدمّر جدول تصدير سيطرة
Select specific functions from your DLL to handle each event = لمعالجة كلّ حدث DLL الدوال المختارة من
DLL Control file = DLL فايل كنترل

Export specific generators to App. folder = تصدير مولدات معينة إلى مكان البرنامج
Trial in debug mode (for testing purposes) = (لأغراض الإختبار) debug نسخة تجريبية بنظام
Check this option if you want to create a custom license generator for your protected application. The generator will be created in a subfolder inside your application folder. = إختر هذا الخيار إذا تريد خلق مولّد رخصة معين للبرنامج المحمي. المولّد سيخلق في داخل مكان البرنامج
Uncheck this option only when you are going to release your protected program. For testing purposes, leave this option checked to avoid storing unnecessary information in your system about your trial status. = قم بإزالة هذا الخيار فقط عند إصدار برنامجك المحمي. لأغراض الإختبارات، يترك هذا الخيار لتجنّب خزن المعلومات الغير ضرورية في نظامك حول حالة تجربتك

&Add = اضافه
&Edit = ويرايش
&Delete = حذف
Name = نام
Company = شركت
Total Customers: = :تعداد مشتريان
New Customer = مشتري جديد
Edit Customer = ويرايش مشتري
Delete Customer = حذف مشتري
Customers = مشتريان
Extra Details = جزئيات اضافي
Add Customer = افزودن مشتري
Update = بروزرساني
Filename = نام فايل
Version = نسخه
Total Software: = :تعداد نرم افزارها
Do you want to delete this software? = آيا مي خواهيد اين نرم افزار حذف شود؟
Confirm = تاييد
Add Software = افزودن نرم افزار
Edit Software = ويرايش نرم افزار
Delete Software = حذف نرم افزار
Duplicate Software = كپي نرم افزار
(leave blank to use the same input and output filename) = (إتركه فارغا لإستعمال نفس الإدخال وأنتاج اسم ملف)
Input File Type = نوع ملف الإدخال
License Unique Key = مفتاح الترخيص الوحيد
Trial Unique Key =  مفتاح التجريب الوحيد
Password Unique Key = مفتاح كلمة السر الوحيد 
Windows Standard Executable (EXE) = Windows Standard Executable (EXE)
Dynamic Link Library (DLL) = Dynamic Link Library (DLL)
OLE Control Extension (OCX) = OLE Control Extension (OCX)
Windows .NET Executable = Windows .NET Executable
Windows NT/XP Service = Windows NT/XP Service
Screensaver File (SCR) = Screensaver File (SCR)
Copy Software = كپي نرم افزار
Reg Unique Key missing. Please, select one. = مفتاح التسجيل الوحيد مفقود. من فضلك إختر واحدآ
Software Manager = مدير نرم افزار
Sofware name missing. Please, select one. = إسم البرنامج مفقود. من فضلك إختر واحدآ
Reg Unique Key is too short. Please, select a new unique key. = مفتاح التسجيل الوحيد قصير جدا.من فضلك إختر مفتاح جديد
Trial Unique Key missing. Please, select one. = مفتاح التجريب الوحيد مفقود. من فضلك إختر واحدآ
Trial Unique Key is too short. Please, select a new unique key. = مفتاح التجريب الوحيد قصير جدا.من فضلك إختر مفتاح جديد
Pass Unique Key missing. Please, select one. = مفتاح العبور الوحيد مفقود. من فضلك إختر واحدآ
Pass Unique Key is too short. Please, select a new unique key. = مفتاح العبور الوحيد قصير جدا.من فضلك إختر مفتاح جديد
The software already exists in database. Please, choose a new software name or version. =  البرنامج موجود في قاعدة البيانات. رجاء،إختر اسم أو نسخة برنامج جديدة
A new License Hash is going to be created. Previous generated licenses will not work if you create a new hash. Proceed? = جديد.إستكمال؟ hash جديدة سيخلق. التراخيص المولّدة السابقة سوف لن تعمل إذا نم تخليق License Hash
Duplicated Software = برنامج منسوخ 
File cannot be opened. Make sure the application is not running or being used. = الملف لا يمكن أن يفتح. تأكّد البرنامج لا يعمل أو  مستعمل
Protection Error = خطاي محافظت
Protect Error = محافظت خطا
File is compressed or already protected. = فايل فشرده شده يا قبلا محافظت شده است
File has a missing macro START or END. Please correct this error before protecting. =  مفقودة فى الملف. رجاء صحّح هذا الخطأ قبل الحماية START أو END macro
File cannot be opened. Make sure that other application is not using it. = الملف لا يمكن أن يفتح. تأكّد بأنّ البرنامج الآخر لا يستعمله
File has an invalid PE header. Unable to protect. = غير صحيح و لا يمكن حمايته PE header الملف له
File contains one macro with few lines of code on it. Please review your macros before protecting. = قبل الحماية macros واحدة ذات عدد سطور قليل.من فضلك راجع macro الملف المراد حمايته يحتوى على
File seems to be in use. Please, close the file to proceed with protection. = يبدو الملف قيد الإستعمال. رجاء، إغلق الملف للإستمرار بالحماية
The splash file does not exist. = فايل صفحه نمايشي وجود ندارد
Splash = صفحه نمايشي
The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = فقط يتم عرضها بشكل صحيح BMP 256 ملف الصورة لا يحتوى على 256 لون.ملفات
The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = الغير مضغوطة فقط يتم عرضها بشكل صحيح BMP مضغوط.ملفات BMP ملف الصورة
Do you want to cancel the protection process? = تريد إلغاء عملية الحماية؟
Cannot open file to protect for writing. Please, make sure that the file is not being used or running. Protection aborted. = لا يمكن فتح الملف المراد حمايته للكتابة. رجاء، تتأكّد أنّ الملف ليس مستعمل أو يعمل. الحماية ألغيت
Cannot write protected file to disk. Please, make sure you have write permits and enough space in your disc. = لا يمكن كتابة الملف المحمي إلى القرص. رجاء، تتأكّد بأنّك عندك سماح بالكتابة والفضاء الكافي في قرصك
Sorry, the DEMO version of WinLicense only allows protection with trial/licensing in debug mode =  الغير كاملة تسمح للحماية فقط بالتجربة / بالترخيص فى نظام التصحيح WinLicense عفوآ ،نسخة
WinLicense DEMO = نسخة غير كاملة WinLicense

&Add License = افزودن مجوز
&Edit License = ويرايش مجوز
&Delete License = حذف مجوز
Create License Key = توليد كد مجوز
Mark as Stolen = علامت گذاري به عنوان مسروقه
Unmark Stolen = ابطال علامت مسروقه
Stolen = مسروقه
Ban Hardware IDs = مسدود كردن كد سخت افزار
Please make a selection... = ...لطفا يك مورد را انتخاب كنيد
License Details = جزئيات مجوز
License Generation = توليد مجوز
Hardware ID = كد سخت افزار
Custom Data = بيانات محددة
Key Type = نوع كليد
Country Locking = قفل كردن كشور
Store generated Licenses in folder: = :ذخيره مجوزهاي توليد شده در زيرفهرست
Generate File Key = توليد كليد به صورت فايل
Generate Registry Key = توليد كليد رجيستري
Generate Text Key = توليد كليد متني
Generate SmartActivate Key = SmartActivate توليد كليد

Total Software: = :البرامج الكليّة
All = همه
Please make a selection... = ...لطفا انتخاب كنيد
Nothing selected. = چيزي انتخاب نشده
Selection: = :انتخاب شده ها
Software: = :نرم افزار
Do you want to mark the current key as stolen? = هل تريد تأشير المفتاح الحالي كمسروق؟
Stolen Keys = كليد هاي سرقت شده
Do you want to unmark the current key from being stolen? = هل تريد إزالة تأشير المفتاح الحالي كمسروق؟
Do you want to delete this license? = هل تريد أن تحذف هذه الرخصة؟
Warning: The generated keys will have the settings from the current project. Proceed? = تحذير: المفاتيح المولّدة سيكون لها خصائص من المشروع الحالي. إستكمال؟
Generate License = توليد مجوز
Cannot create directory: = :امكان ايجاد زيرفهرست وجود ندارد
Please, select which type of license you want to generate = لطفا نوع مجوزي را كه مي خواهيد توليد شود انتخاب كنيد
Keys successfully generated in folder: = :كدها با موفقيت در زيرفهرست ساخته شدند
Please, first select a valid application to protect = لطفا ابتدا يك برنامه معتبر را براي محافظت انتخاب كنيد
Ban Hardware Id = مسدود كردن كد سخت افزار

License Restrictions = محدوديت هاي مجوز
Customer = العميل
Software = البرنامج
Save = حفظ
Edit License = ويرايش مجوز
Add License = افزودن مجوز
Please, select a customer from database. = لطفا يك مشتري را از بانك اطلاعاتي انتخاب كنيد
License Manager = مديريت مجوز
Please, select a software from database. = لطفا يك نرم افزار را از بانك اطلاعاتي انتخاب كنيد
Please, insert a Hardware ID for verification = لطفا يك كد سخت افزار را براي بررسي وارد كنيد
The inserted Hardware ID is valid = كد سخت افزار وارد شده معتبر است
Invalid Hardware ID inserted = كد سخت افزار وارد شده نامعتبر است
Another instance of WinLicense is running =  در حال اجرا است WinLicense نسخه ديگري از 
You have enabled SmartActivate keys but you have not selected any type of License Keys accepted (Single file or Registry) Remember that you have to use WLRegSmartKeyInstallToFile or WLRegSmartKeyInstallToRegistry to finally install the SmartActivate key = أخيرا SmartActivate لتركيب مفتاح Wlregsmartkeyinstalltoregistry أو Wlregsmartkeyinstalltofile لكنّك لم تختر أيّ نوع من الرخص سيكون مقبولا(ملف أو تسجيل) تذكّر بأنّك يجب أن تستعمل SmartActivate لقد مكّنت مفاتيح
File has not being simulated: = :فايل شبيه سازي نشد 
Please simulate the file before protection or uncheck the "Force simulation before protecting" checkbox = "رجاء حاك الملف قبل الحماية أو أزل الإختيار"محاكاة  قبل حماية
Warning: Your application has been set up to be registered with a valid license key, but you have not selected any way of registration. If you continue, your application will not be able to be registered. Proceed? = تحذير: البرنامج أسّس لكي يسجّل مع مفتاح رخصة صحيح، لكنّك لست مختار بأية طريقة سيكون التسجيل. البرنامج لن يكون قادر على أن يكون مسجّل. الإستكمال؟
Warning: Your application has been set up to be extended with trial extension key, but you have not selected any way to extend the trial period. If you continue, your application will not be able to be extended. Proceed? = تحذير: البرنامج أسّس لكي يمتدّ بمفتاح إمتداد تجريبى، لكنّك لست مختار بأية طريقة سيكون إمتداد فترة التجربة. البرنامج  لن يكون قادر على أن يكون ممتد. الإستكمال؟
Your application header is incompatible with WinLicense. Do you want WinLicense to rebuild your application header? = البرنامج؟ header أن يعيد بناء WinLicense هل تريد .WinLicense البرنامج غير متوافق مع header
Sorry, WinLicense Standard cannot protect .NET files. You need to upgrade to WinLicense Professional for .NET support. Upgrade now? = إستكمال؟. .NET لدعم WinLicense Professional تحتاج للتحديث إلى. .NET لا يستطيع حماية الملفات WinLicense Standard ،عفوآ
Note: CodeReplace has been added into your application = إلى البرنامج CodeReplace ملاحظة:أضيف
(Application header has been rebuilt by WinLicense) = (WinLicense البرنامج أعيد بناء من قبل header)
Error: The selected file is not an x64 application. You need WinLicense x32 to protect that application. = .لحماية هذا البرنامج WinLicense x32 أنت محتاج .x64 خطأ: البرنامج المختار ليس برنامج
Error: The selected file is an x64 application. You need WinLicense x64 Edition to protect that application. = .لحماية هذا البرنامج WinLicense x64 أنت محتاج .x64 خطأ: البرنامج المختار برنامج
Sorry, the MAP file was not found: = لم يوجد MAP عفوآ، ملف
Please, generate a MAP file for your application = للبرنامج MAP رجاء، توليد ملف
Sorry, the current version of WinLicense does not support CodeReplace in Visual Basic Pcode applicaitons = Visual Basic Pcode فى برامج CodeReplace لا يدعم WinLicense عفوآ، الإصدار الحالى من
Sorry, the current version of WinLicense does not support CodeReplace in .NET applications = .NET فى برامج CodeReplace لا يدعم WinLicense عفوآ، الإصدار الحالى من
There are some functions highly executed and some not executed in simulation. Do you want to unselect those functions? = نفّذت بعض الدوال إلى حد كبير والبعض ليسوا منفّذين في المحاكاة. هل تريد إلى غير منتقاة تلك الدوال؟
There are some functions highly executed in simulation. Do you want to unselect those functions? = نفّذت هناك بعض الدوال إلى حد كبير . هل تريد إلى غير منتقاة تلك الدوال؟
There are some functions not executed in simulation. Do you want to unselect those functions? = نفّذت هناك بعض الدوال  ليسوا منفّذين في المحاكاة. هل تريد إلى غير منتقاة تلك الدوال؟
Messages exported to: = :صدّرت الرسائل إلى
Messages imported from: = :الرسائل إستوردت من
WinLicense GUI Overview = WinLicense GUI حول
Trial Settings = تنظيمات دوره آزمايشي
Trial SDK = دوره آزمايشي SDK
Registration SDK = ثبت نام SDK
Password Protection = محافظت توسط كلمه عبور
Miscellaneous SDK = متفرقه SDK
Hardware Lock = قفل سخت افزار
WARNING: Protected in Trial Debug Mode = دوره آزمايشي محافظت شد Debug هشدار :‌به صورت
Click and select here = كليك كرده و اينجا را انتخاب كنيد
ERROR: None of the functions handlers where specified in DLL Control = DLL خطأ: لا أحد من عمال الدوال حدّدوا في سيطرة
Sorry, WinLicense DEMO does not support RISC-128 processors = RISC-128 لا يدعم معالجات WinLicense DEMO ، عفوآ
Sorry, WinLicense DEMO does not support Dynamic Opcodes = الديناميكية Opcodes لا يدعم معالجات WinLicense DEMO ، عفوآ
Signature Level 2 is not accepted for the current Software. Please, go to the Sofware Panel and re-create a new License Hash for your software = للبرنامج License Hash وتعيد إنشاء Sofware Panel المستوى ٢ لم يقبل للبرنامج الحالي. رجاء، تذهب إلى
.NET Module = .NET وحدة
File has a missing macro START or END. Please review your macros again: = :ثانية macros مفقودة فى الملف.رجاء راجع START أو END macro
File cannot be opened. Make sure that other application is not using it: = الملف لا يمكن أن يفتح. تأكّد بأنّ البرنامج الآخر لا يستعمله
File has an invalid PE header. Unable to inspect file: = :تالف. لا يمكن فحص الملف PE heade الملف المراد حمايته يحتوى على
File contains one macro with few lines of code on it. Please review your macros again: = :ثانية macros واحدة ذات عدد سطور قليل.من فضلك راجع macro الملف المراد حمايته يحتوى على
Deep file analysis in progress = تحليل پيشرفته فايل در حال انجام است
File analysis in progress = تحليل فايل در حال انجام است
Please wait... = ...لطفا صبر كنيد
Analyzing CodeReplace macros = CodeReplace macros تحليل
Are you sure you want to remove the selected Hardware ID? = المختار؟ Hardware ID أنت متأكّد تريد أن تزيل
List of Banned  Hardware IDs: = : ليست سخت افزارهاي غير مجاز
Add = افزودن
Remove = حذف
Done = پايان
Generating License Hash = License Hash توليد
Generate Password = توليد كلمه عبور
Password Generation = ايجاد كلمه عبور
Store generated Passwords in folder: = :حفظ كلمات السر المولدة في الحافظة
Total Passwords: = : مجموع كلمات كليدي 
Do you want to delete the selected record? = آيا مي خواهيد ركورد انتخاب شده را حذف كنيد؟
Password file generated in folder: = :فايل كلمات عبور در زير فهرست ساخته شد
Password Generator = توليد كننده كلمه عبور
Password Manager = مدير كلمه عبور
Details = جزئيات

Add Password = افزودن كلمه عبور
Edit Password = ويرايش كلمه عبور
Please, select a customer to generate the password = لطفا يك مشتري را براي توليد كلمه عبور انتخاب كنيد
Please, select a software to generate the password = لطفا يك نرم افزار را براي توليد كلمه عبور انتخاب كنيد
Rolling back your actions = بازگرداندن اعمال انجام شده

Generate Extension = توليد اضافات
Level = درجه
Trial Extension Generation = توليد اضافات دوره آزمايشي
Store generated Extensions in folder: = :ذخيره اضافات توليد شده در زير فهرست
Generate File Key = توليد فايل كليد
Generate Registry Key = توليد كليد رجيستري
Trial extension key/s generated in folder: = :كليدهاي اضافي دوره آزمايشي در زيرفهرست ساخته شده اند
Trial Extension Generator = توليد كننده اضافات دوره آزمايشي
Edit = ويرايش
Add Trial Extension = افزودن اضافات دوره آزمايشي
Edit Trial Extension = ويرايش اضافات دوره آزمايشي
Please, select a software to generate the trial extension = لطفا براي توليد اضافات دوره آزمايشي ،‌يك نرم افزار را انتخاب كنيد

Warning: Trial in Debug Mode = Debug هشدار : دوره آزمايشي در حالت
Debug Mode Trial = Debug دوره آزمايشي 
The application that you are going to protect will not include the SecureEngine Trial Storing Manager*. = .SecureEngine Trial Storing Manager* البرنامج الذى ستحميه لن يتضمّن
The trial information will be stored under the registry key: = :معلومات التجربة ستخزن تحت مفتاح التسجيل
(You can access to that key to reset/test the WinLicense Trial Engine) = (WinLicense يمكن أن تدخل إلى ذلك المفتاح لإعادة / لإختبر محرّك تجربة)
*To enable the SecureEngine Trial Storing Manager, uncheck the option "Trial in debug mode" in the Protect screen. = في شاشة الحماية "debug قم بإزالة الإختيار"نسخة تجريبية بنظام ، SecureEngine Trial Storing Manager لتمكين
Don't show this screen again = اين صفحه مجددا نمايش داده نشود

Do you want to delete the selected client? = آيا مي خواهيد مشتري انتخاب شده حذف شود؟
Enter new Hardware ID to ban: = :جديد للمنع Hardware ID إدخل
The entered Hardware ID does not seem to be valid (must be at least 32 chars) Please, enter a valid Hardware ID = صحيحة Hardware ID الداخلة لا تبدو صحيحة(يجب أن تكون على الأقل ٣٢ حرف)ي.رجاء، إدخالHardware ID

File has a missing macro START or END. Please correct this error before protecting: = :مفقودة فى الملف. رجاء صحّح هذا الخطأ قبل الحماية START أو END macro
File has an invalid PE header. Unable to protect: = :غير صحيح و لا يمكن حمايته PE header الملف له
File contains one macro with few lines of code on it. Please review your macros before protecting: =  :macros واحدة ذات عدد سطور قليل.من فضلك راجع macro الملف المراد حمايته يحتوى على
The input file seems to be in use. Please, close the file to proceed with protection: = :يبدو الملف قيد الإستعمال. رجاء، إغلق الملف للإستمرار بالحماية

Code Virtualization = إفتراضية الكود
Virtual Opcodes Obfuscation = المفترضة Opcodes تشويش
Current: = :الحالى
Virtual Machine Complexity = درجة تعقيد الألة الوهمية
Size (Approx): = :(الحجم (بالتقريب
Opcodes Mutation = Opcodes تغيير
Multiple Virtual Machines = المكائن الإفتراضية المتعدّدة
NumVMs * SizeVM: = حجم الألة الوهمية  * عدد الألات الوهمية
Fake Stack Emulation = مزيفة Stack محاكاة
Strip Relocations (EXEs) = (EXEs) حذف جايگشتهاي فايل
Strip relocations = حذف جايگشتهاي فايل
Re-Virtualization = Re-Virtualization
Multi Branch Technology = فن آوري چند شاخه اي
Fake Emulation = المحاكاة الخداعية
Keep original name = حفظ نام اصلي
Functions that will be virtualized: = :توابعي كه مجازي خواهد شد

You can customize how complex will be the Virtual Machine opcodes. The size of the generated opcodes depend on the complexity selected = على التعقيد الذي تختار opcodes المولّدة. يعتمد حجم opcodes يمكن أن تفصّل كم تعقد
You can customize how complex the generated virtual machine will be. The size of the virtual machine depends on the complexity that you select = يمكن أن تفصّل كم تعقد الماكنة الإفتراضية المولّدة. يعتمد حجم الماكنة الإفتراضية على التعقيد الذي تختار
You can mutate the internal virtual opcodes, generating a more complex virtual machine = الإفتراضية الداخلية، مولدآ ماكنة إفتراضية أكثر تعقيدا opcodes يمكن أن تبدّل
The generated Virtual Machine and virtual opcodes will be placed inside the last section of your application. You can rename the last section of your application as desired = سيوضع داخل القسم الأخير من تطبيقك. يمكن أن تبدّل إسم القسم الأخير من تطبيقك كما هو مطلوب opcodes الماكنة الإفتراضية المولّدة و
You can create several Virtual Machines inside your protected application. Each Virtual Machine will process specific blocks of code in your application = يمكن أن تخلق عدّة مكائن إفتراضية داخل تطبيقك المحمي. كلّ ماكنة إفتراضية ستعالج كتل معيّنة من الكود في تطبيقك
This option will assume the stack to be initilized to zero for all not allocated entries in stack. This option should be enabled for PureBasic applications = PureBasic هذا الخيار يجب أن يمكّن لتطبيقات.stack معرفة لصفر لكلّ المداخل الغير مخصّصة في stack هذا الخيار سيفترض
You can remove the relocations section from the PE header for EXE files, reducing the size of the final protected application = مخفّضآ حجم التطبيق المحمي النهائي ،EXE لملفات PE header يمكن أن تزيل مقطع الإنتقال من
Re-Virtualization is an extremely powerful technique against Reverse Engineering. But it can decrease a lot the performance in speed in the protected blocks.  Please, check the performance of your application when protected with Re-Virtualization = Re-Virtualization تقنية قويّة جدا ضدّ الهندسة العكسية. لكنّه يمكن أن ينقص الكثير في السرعة في الكتل المحمية. رجاء، تدقّق أداء تطبيقك عندم الحماية مع Re-Virtualization
This option will insert multiple conditional branch instructions inside your unique virtual machine, making it harder to analyse = داخل الألة الوهمية مما يجعلها أصعب فى التحليل conditional branch هذا الإختيار يزيد تعليمات

Please, select an application to protect = لطفا يك برنامه را براي محافظت انتخاب كنيد
The selected application does not have any functions to virtualize. Please insert functions using the SDK = SDK البرنامج المختار لا يحتوى أيّ دوال للإفتراضية. رجاء أدخل الدوال مستخدمآ
All functions to virtualize were disabled. Please, select at least one = كلّ الدوال المراد إفتراضيتها عطّلت. رجاء، تختار على الأقل واحدة
Warning! A macro with no code inside has been found. This might be due to compiler optimizations. Please, disable your compiler optimizations or review each macro. = macro أو تراجع كل compiler رجاء، توقف تحقيق أمثلية.compiler بدون كود داخلها.هذا قد بسبب تحقيق أمثلية macro تحذير!وجد
Virtual Functions = توابع مجازي
Inserted via "Call VarPtr": = :"Call VarPtr" وارد شده توسط
Inserted via inline Assembly: = :inline Assembly وارد شده توسط
Inserted via auxiliar API: = : API وارد شده توسط 
Inserted via MAP file: = :MAP وارد شده توسط فايل
NO FUNCTIONS FOUND TO VIRTUALIZE!!! = !!!تابعي براي مجازي سازي يافت نشد
(Application header has been rebuilt by Code Virtualizer) = (Code Virtualizer البرنامج أعيد بناءه بواسطة header)
Protecting an Application = محافظت از يك برنامه
Learn About Virtualizer = يادگيري درباره مجازي كننده
Code Virtualization = Code Virtualization
Code Virtualize Macros = Code Virtualize Macros
**** Sorry, the DEMO version does not support protection via command line **** = ****command line عفوآ، لنسخة الغير كاملة لا تدعم الحماية من خلال***
*** ERROR: File to protect cannot be acccessed. (Exit code 2) *** = *** (خطأ: الملف المراد حمايته لا يمكن الوصول إليه. (رمز خروج ٢ ***
*** ERROR: File does not have any blocks to protect. (Exit code 3) *** = *** (خطأ: الملف ليس به أيّ كتل للحماية. (رمز خروج ٣ ***
*** ERROR: File to protect cannot be opened. (Exit code 5) *** = *** (خطأ: الملف المراد حمايته لا يمكن أن يفتح. (رمز خروج ٥ ***
Generating Specific Virtual Machine = توليد ماشين مجازي مخصوص
Virtualizing Function = عمليات مجازي سازي
Re-Virtualizing ... = ...مجازي سازي مجدد
Flushing file ... = ...تصحيح فايل
Sorry, the DEMO version only allows one Virtual Machine per application = متاسفانه نسخه نمايشي فقط يك ماشين مجازي براي هر برنامه را در اختيار مي گذارد
Sorry, the DEMO version does not support Re-Virtualization = متاسفانه نسخه نمايشي از مجازي سازي چند باره پشتيباني نمي كند 
The application is already protected. You cannot protect an already protected application in the DEMO version =  اين برنامه قبلا محافظت شده است . شما نمي توانيد يك برنامه محافظت شده را به صورت نسخه نمايشي محافظت كنيد
The Input application cannot be accessed. Please, check that the application is not in use: =  :برنامه ورودي در دسترس نيست . لطفا بررسي كنيد كه برنامه در حال استفاده نباشد
The Output application cannot be accessed. Please, check that the application path is valid or file is not in use: = : برنامه خروجي در دسترس نيست. لطفا بررسي كنيد كه مسير برنامه صحيح باشد و فايل در حال استفاده نباشد
Limitations in DEMO version: = :محدوديت ها در نسخه نمايشي
Virtual Opcodes Obfuscation set to NORMAL = الإفتراضي قرّر وضع طبيعي Opcodes تشويش
Virtual Machine Complexity set to NORMAL = پيچيدگي ماشين مجازي به وضعيت عادي تنظيم شد
Only ONE macro is virtualized = واحدة فقط macro تم إفتراض
The Output application cannot be accessed. Please, check that the application is not in use: = :البرنامج المحرج لا يمكن الوصول إليه.تأكد أنه غير مستخدم
PE Information = :PE اطلاعات
Input PE file: = :ورودي PE فايل
Output PE file: = :خروجي PE فايل
Virtual Functions found: = :توابع مجازي  يافت شده
PE file analysis... OK! = !تمت...PE تحليلات ملف
Virtualization = مجازي سازي
Generating Specific Virtual Machine = توليد ماشين مجازي مخصوص
Size: = :اندازه
Virtualizing Function = تابع مجازي سازي
Start: = :شروع
Skipped = ناديده گرفته شده
bytes = بايت
Cancelling... = ...لغو
Re-Virtualization = مجازي سازي مجدد
Re-Virtualizing ... = ...مجازي سازي مجدد
Final Stats = وضعيت نهايي
Virtualized Functions: = :توابع مجازي شده 
Skipped Functions: = :توابع ناديده گرفته شده
Errors: = :خطاها
Increase in size: = :افزايش اندازه
Application successfully protected! = !برنامه با موفقيت محافظت شد
Protection CANCELLED! = !محافظت لفو شد
Do you really want to Cancel the protection process? = آيا مي خواهيد محافظت لغو شود؟
Cancel Protection = لغو محافظت
Select a Software to protect from the WinLicense database = انتخاب كنيد WinLicense نرم افزاري را براي محافظت توسط